artillery/commerce.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  # target: http://localhost:3000
  target: http://hhp-alb-515848074.ap-northeast-2.elb.amazonaws.com
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 120
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
    - duration: 300
      arrivalRate: 30
      rampTo: 20
      name: continuous traffic
  processor: "./random_page.js"
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  # plugins:
  #   ensure: {}
  #   apdex: {}
  #   metrics-by-endpoint: {}
  # apdex:
  #   threshold: 100
  # ensure:
  #     thresholds:
  #       - http.response_time.p99: 100
  #       - http.response_time.p95: 75
scenarios:
  - flow:
    - function: "generateRandomPage"
    - get:
        url: "/api/v1/products"
        qs:
          page: "{{ page }}"
          perPage: "{{ perPage }}"
          searchText: "{{ searchText }}"
          isDesc: "{{ isDesc }}"